rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
        acc_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + i] = *(time_start + i);
        gyr_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + i] = *(time_start + i);
        mag_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + i] = *(time_start + i);
    }
    acc_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + 4] = m_current_sensor_samples;
    gyr_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + 4] = m_current_sensor_samples;
    mag_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + 4] = m_current_sensor_samples;

    //Setup accelerometer notification first
    acc_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    acc_notify_params.handle = m_ss.data_handles[0].value_handle;
    acc_notify_params.p_data = acc_characteristic_data;
    acc_notify_params.p_len  = &acc_data_characteristic_size;
    acc_notify_params.offset = 0;

    //Setup gyroscope notification second
    gyr_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    gyr_notify_params.handle = m_ss.data_handles[1].value_handle;
    gyr_notify_params.p_data = gyr_characteristic_data;
    gyr_notify_params.p_len  = &gyr_data_characteristic_size;
    gyr_notify_params.offset = 0;

    //Setup magnetometer notification third
    mag_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    mag_notify_params.handle = m_ss.data_handles[2].value_handle;
    mag_notify_params.p_data = mag_characteristic_data;
    mag_notify_params.p_len  = &mag_data_characteristic_size;
    mag_notify_params.offset = 0;

    //Set the notifcation_done boolean to false and start notifications.
    //The boolean will be set to true in the BLE handler when the notification
    //is complete, alerting us to send out the next notification.
    m_notification_done = false;
    uint32_t ret = sd_ble_gatts_hvx(m_conn_handle, &acc_notify_params); //acc data notification
    ret = sd_ble_gatts_hvx(m_conn_handle, &gyr_notify_params); //gyr data notification
    ret = sd_ble_gatts_hvx(m_conn_handle, &mag_notify_params); //mag data notification

    while (!m_notification_done) {} //wait for the three notifications to go out before continuing
    //APP_ERROR_CHECK(ret); //Uncommenting this can help debug notification errors
}

uint64_t findGCD(uint64_t a, uint64_t b)
{
    if (b == 0) return a;
    return findGCD(b, a % b);
}

uint64_t findLCM(uint64_t a, uint64_t b)
{
    return (a * b) / findGCD(a, b);
}

float findDecimalLCM(float a, float b)
{
    return findLCM(a * 1000000, b * 1000000) / 1000000.0;
}

void calculate_samples_and_connection_interval()
{
    //This method is used to select the appropriate number of sensor samples to collect
    //and the min-max connection interval to select to minimize data loss.

    //This method is necessary as a consequence of not being able to set a specific 
    //connection interval, the interval must be negotiated between two devices and thus
    //is prone to not be exactly what we want. On iOS devices, for example, the minimumn
    //and maximum requested connection interval must be at least 15 milliseconds apart. 
    //Depending on the current sensor ODR 15 milliseconds can be anywhere from 0.75 sensor
    //sample at an ODR of 50 Hz to 6 samples at 400 Hz. Basically, depending on what the 
    //negotiated connection interval is, it may make sense to collect more or less samples
    //at a time from the sensors.

    //Since we won't know what the actual connection interval will be until after it's
    //negotiated, we attempt to pick a min and max interval that will maximize our chances
    //of having low data loss.

    float minimum_connection_interval[MAX_SENSOR_SAMPLES + 1]; //in milliseconds
    float expected_data_loss[MAX_SENSOR_SAMPLES + 1]; //in milliseconds
    float lowest_expected_data_loss = 18 * MAX_SENSOR_SAMPLES; //start high, losing all data
    int lowest_loss_index = 0;

    for (int i = 1; i <= MAX_SENSOR_SAMPLES; i++)
    {
        //We look at all the possiblities for the number of samples we can collect
        //(anywhere from 1 to MAX_SENSOR_SAMPLES) and look at the necessary minimum
        //connection intervals needed to calculate each one. As mentioned above, to work
        //with iOS the min and max intervals must be divisible by 15 ms, so we round the 
        //minimum interval up to the nearest 15th millisecond.
        minimum_connection_interval[i] = ceil(1000.0 * i / current_sensor_odr);
        minimum_connection_interval[i] += (15 - (int)minimum_connection_interval[i] % 15);
        expected_data_loss[i] = 0; //initialize the expected data loss for each sample amount

        float data_loss_per_connection_interval[13];
        for (int j = 0; j <= 12; j++)
        {
            //In theory the connection interval can be set anywhere between the min and max
            //connection interval (inclusive) in steps of 1.25ms. We need look at all of these
            //possibilites
            float current_connection_interval = minimum_connection_interval[i] + (float)j * 5.0 / 4.0; //convert from 1.25 ms units to ms

            //Given the current connection interval we calculate how many complete cycles it takes
            //for sensor odr * sensor samples to fall back to an even connection interval. We can use
            //this ratio of data_cycles/conntion_intervals to get an idea of how much data we lose. For example,,
            //with a connection interval of 45ms, an ODR of 400 Hz and 10 data samples, every 5 connection
            //events (45ms * 5 = 225ms) we will gather 9 complete data sets (10/400 * 9 = 225ms). Only 1 complete 
            //data set goes out every connection interval so we effectively lose 4/9 of our data every
            //225 milliseconds (which is obviously terrible).
            float connection_cycle_length = findDecimalLCM(current_connection_interval, 1000 * i / current_sensor_odr);

            float connection_intervals_per_cycle = connection_cycle_length / current_connection_interval;
            float total_data_packets = connection_cycle_length / (1000 * i / current_sensor_odr);
            float total_data_loss_per_cycle = (total_data_packets - connection_intervals_per_cycle) / total_data_packets * i * 18.0; //bytes in a complete sensor reading

