rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
            data_loss_per_connection_interval[j] = total_data_loss_per_cycle / connection_intervals_per_cycle;
        }

        //At this stage we have an array with the expected data loss (in bytes) for each possibility
        //for the connection interval from min to max. From a statistics standpoint, we can turn this
        //into an expected value given the odds of getting each one of these connection intervals. In 
        //theory there should be an equal probability of any of these, however, in my experience the
        //maximum interval is chosen the vast majority of the time, the minimum interval the next most
        //frequent, and something in between is rare. This may need to be altered in the future but 
        //I'd say the odds are as follows: max_interval = 95%, min_interval = 4%, inbetween = 1%
        expected_data_loss[i] += data_loss_per_connection_interval[0] * 0.04;
        expected_data_loss[i] += data_loss_per_connection_interval[12] * 0.95;
        for (int j = 1; j < 12; j++) expected_data_loss[i] += data_loss_per_connection_interval[j] * .01 / 11.0;

        if (expected_data_loss[i] < lowest_expected_data_loss)
        {
            lowest_expected_data_loss = expected_data_loss[i];
            lowest_loss_index = i;

            //Update the global variables for desired min and max connection interval
            desired_minimum_connection_interval = minimum_connection_interval[i];
            desired_maximum_connection_interval = 15 + desired_minimum_connection_interval;
        }
    }
    
    //At the end of the algorithm, we select the sensor sample amount and min-max connection interval
    //that gives us the lowest expected data loss.
    m_current_sensor_samples = lowest_loss_index;
}

void set_sensor_samples(int actual_connection_interval)
{
    //As mentioned above in the alcualte_samples_and_connection_interval() method,
    //there's no guarantee as to what the connection interval is going to be set at.
    //Once the interval has been established we update the sample amount so that
    //sensor odr * sample amount is as close to the connection interval (without
    //exceeding it) as possible.
    for (int i = MAX_SENSOR_SAMPLES; i >= 0; i--)
    {
        if ((1000.0 * i / current_sensor_odr) < actual_connection_interval)
        {
            SEGGER_RTT_printf(0, "%d sensor samples selected.\n", i);
            m_current_sensor_samples = i;

            //Not 100% necesary here, however, it may be handy for debugging.
            //Print out the expected data loss per connection interval to 
            //confirm our selection was ok. Ideally this number would be a good
            //deal under 1 byte.
            float connection_cycle_length = findDecimalLCM(actual_connection_interval, 1000 * i / current_sensor_odr);

            float connection_intervals_per_cycle = connection_cycle_length / actual_connection_interval;
            float total_data_packets = connection_cycle_length / (1000 * i / current_sensor_odr);
            float total_data_loss_per_cycle = (total_data_packets - connection_intervals_per_cycle) / total_data_packets * i * 18.0; //bytes in a complete sensor reading

            SEGGER_RTT_printf(0, "Expected data loss per connection interval (bytes): %d/%d\n", total_data_loss_per_cycle, connection_intervals_per_cycle);
            break;
        }
    }
}

void data_read_handler(int measurements_taken)
{
    //Everytime the data reading timer goes off we take sensor readings and then 
    //update the appropriate characteristic values. The timer should go off SENSOR_SAMPLES times
    //every connection interval
    imu_comm.acc_comm.get_data(acc_characteristic_data, SAMPLE_SIZE * measurements_taken);
    imu_comm.gyr_comm.get_data(gyr_characteristic_data, SAMPLE_SIZE * measurements_taken);
    imu_comm.mag_comm.get_data(mag_characteristic_data, SAMPLE_SIZE * measurements_taken);
}


//Functions for updating sensor power modes and settings
static void sensor_idle_mode_start()
{ 
    //In this mode, the appropriate TWI bus(es) is active and power is going to the sensor(s) but the 
    //sensor is put into sleep mode. A red LED blinking in time with the connection 
    //interval shows when this mode is active.
    if (current_operating_mode == SENSOR_IDLE_MODE) return; //no need to change anything if already in idle mode

    //swap to the red LED, also make sure that the blue and green LEDs are off
    active_led = RED_LED;
    nrf_gpio_pin_set(GREEN_LED); //LEDs must be set high to turn off
    nrf_gpio_pin_set(BLUE_LED); //LEDs must be set high to turn off

    ret_code_t err_code;

    if (current_operating_mode == SENSOR_ACTIVE_MODE)
    {
        //If we're transitioning from active to idle mode we need to stop the data collection timer
        //and then put the sensor into sleep mode.
        //err_code = app_timer_stop(m_data_reading_timer); //Even if the timer isn't actively on it's ok to call this method
        data_timers_stop();
        
        //Put all sensors into idle mode, any of the sensors that are active
        //will be properly initialized
        lsm9ds1_idle_mode_enable();
        fxos8700_idle_mode_enable();
        fxas21002_idle_mode_enable();

        //the LED is deactivated during data collection so turn it back on
        //err_code = app_timer_start(m_led_timer, LED_DELAY, NULL); //Even if the timer is already on it's ok to call this method
        led_timers_start();
    }
    else 
    {
        //If we aren't in sensor active or idle mode, it means that we arrived here from connection mode.
        //This means that both the TWI bus and sensors need to be turned on. There are two reasons why we'd
        //be turning on the sensors, either we're about to take data readings, or, we want to update the
        //sensor settings. In both cases we need to turn on the TWI bus to enable communication, but
        //before doing so we need to see if a call from the front end to use a different sensor has been made.

        uint8_t new_sensors = 0;

        SEGGER_RTT_printf(0, "Sensors in settings array: %d, %d, %d\n", sensor_settings[ACC_START + SENSOR_MODEL], sensor_settings[GYR_START + SENSOR_MODEL], sensor_settings[MAG_START + SENSOR_MODEL]);

        if (imu_comm.sensor_model[ACC_SENSOR] != sensor_settings[ACC_START + SENSOR_MODEL])
        {
            new_sensors |= 0b001;
            default_sensors[ACC_SENSOR] = sensor_settings[ACC_START + SENSOR_MODEL];
            sensors_initialized[ACC_SENSOR] = false;
        }

        if (imu_comm.sensor_model[GYR_SENSOR] != sensor_settings[GYR_START + SENSOR_MODEL])
        {
            new_sensors |= 0b010;
            default_sensors[GYR_SENSOR] = sensor_settings[GYR_START + SENSOR_MODEL];
            sensors_initialized[GYR_SENSOR] = false;
        }
        
